Белгипрозем_2017/src/Catalogs/Резолюции/Резолюции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Резолюции</name>
  <attributes>
    <name>АвторРезолюции</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнесРезолюцию</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезолюции</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресацииАвтора</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.Рассмотрение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресацииАвтора</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстРезолюции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/InformationRegisters/ИсполнителиЗадач/ИсполнителиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсполнителиЗадач</name>
  <dimensions>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Catalogs/Резолюции/ManagerModule.bsl
// УправлениеДоступом

// Возвращает строку, содержащую перечисление полей доступа через запятую
// Это перечисление используется в дальнейшем для передачи в метод 
// ОбщегоНазначения.ПолучитьЗначенияРеквизитов()
Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат "Документ,АвторРезолюции,ВнесРезолюцию,ОсновнойОбъектАдресацииАвтора,ДополнительныйОбъектАдресацииАвтора";
	
КонецФункции

// Заполняет переданный дескриптор доступа
//
Процедура ЗаполнитьДескрипторДоступа(ОбъектДоступа, ДескрипторДоступа) Экспорт
	
	ДескрипторДоступа.ДескрипторВладельца = 
		РегистрыСведений.ДескрипторыДоступаДляОбъектов.НайтиДескрипторДляОбъекта(ОбъектДоступа.Документ);
		
	Если ТипЗнч(ОбъектДоступа.АвторРезолюции) <> Тип("СправочникСсылка.КонтактныеЛица") Тогда
		
		ДескрипторДоступа.ДобавитьПользователя(
			"Автор",
			ОбъектДоступа.АвторРезолюции,
			ОбъектДоступа.ОсновнойОбъектАдресацииАвтора,
			ОбъектДоступа.ДополнительныйОбъектАдресацииАвтора);	
		
	КонецЕсли;
		
	ДескрипторДоступа.ДобавитьПользователя(
		"Внесший",
		ОбъектДоступа.ВнесРезолюцию);	
	
КонецПроцедуры

// Возвращает Истина, указывая тем самым, что этот объект сам заполняет свои права
//
Функция ЕстьМетодЗаполнитьПраваДоступа() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Заполняет параметр ПраваДоступа правами доступа, вычисляя их на
// основании переданного дескриптора доступа.
// Если указан параметр ПротоколРасчетаПрав, то в него
// заносится список данных, которые были использованы для расчета прав.
Процедура ЗаполнитьПраваДоступа(ДескрипторДоступа, ПраваДоступа, ПротоколРасчетаПрав) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// права владельца
	СоответствиеПравВладельца = Новый Соответствие;
	ДокументооборотПраваДоступа.СкопироватьПраваДескриптора(ДескрипторДоступа.ДескрипторВладельца, СоответствиеПравВладельца);
	
	// права на чтение
	Для каждого Эл Из СоответствиеПравВладельца Цикл
		ПраваПользователя = Новый Структура("Чтение, Добавление, Изменение, Удаление, УправлениеПравами",
				Эл.Значение.Чтение, Ложь, Ложь, Ложь, Ложь);
				
		ДокументооборотПраваДоступа.ДобавитьПользователяВСоответствиеПрав(
			ПраваДоступа,
			Эл.Ключ,
			Неопределено,
			Неопределено,
			ПраваПользователя);	
	КонецЦикла; 
	
	Если ПротоколРасчетаПрав <> Неопределено Тогда
		ПротоколРасчетаПрав.Добавить(НСтр("ru = 'По документу'"));
	КонецЕсли;
	
	// права на добавление и изменение
	Для Каждого Эл Из ДескрипторДоступа.Пользователи Цикл
		
		Если ТипЗнч(Эл.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			
			НайденноеЗначение = СоответствиеПравВладельца.Получить(Эл.Пользователь);
			Если НайденноеЗначение = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			
			Если Эл.Ключ = "Автор" Или Эл.Ключ = "Внесший" Или Эл.Ключ = "" Тогда
				
				ПраваПользователя = Новый Структура("Чтение, Добавление, Изменение, Удаление, УправлениеПравами",
					НайденноеЗначение.Чтение, НайденноеЗначение.Добавление Или НайденноеЗначение.Изменение, НайденноеЗначение.Изменение, НайденноеЗначение.Изменение, Ложь);
					
				Если Эл.Ключ = "Автор" Тогда
					Если ПротоколРасчетаПрав <> Неопределено Тогда
						ПротоколРасчетаПрав.Добавить(НСтр("ru = 'Автор резолюции'"));
					КонецЕсли;
				Иначе
					Если ПротоколРасчетаПрав <> Неопределено Тогда
						ПротоколРасчетаПрав.Добавить(НСтр("ru = 'Внесший резолюцию'"));
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				
				ВызватьИсключение НСтр("ru = 'Неизвестный ключ пользователя.'");
				
			КонецЕсли;			
			
			ДокументооборотПраваДоступа.ДобавитьПользователяВСоответствиеПрав(
				ПраваДоступа,
				Эл.Пользователь,
				Неопределено,
				Неопределено,
				ПраваПользователя);
			
			
		ИначеЕсли ТипЗнч(Эл.Пользователь) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
			
			ИсполнителиРоли = РегистрыСведений.ИсполнителиЗадач.ПолучитьИсполнителейРоли(Эл.Пользователь, Эл.ОсновнойОбъектАдресации, Эл.ДополнительныйОбъектАдресации);
			Для каждого ИсполнительРоли Из ИсполнителиРоли Цикл
				
				НайденноеЗначение = СоответствиеПравВладельца.Получить(ИсполнительРоли.Исполнитель);
				Если НайденноеЗначение = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если Эл.Ключ = "Автор" Или Эл.Ключ = "" Тогда
				
					ПраваПользователя = Новый Структура("Чтение, Добавление, Изменение, Удаление, УправлениеПравами",
						НайденноеЗначение.Чтение, НайденноеЗначение.Добавление Или НайденноеЗначение.Изменение, НайденноеЗначение.Изменение, НайденноеЗначение.Изменение, Ложь);
				
					Если ПротоколРасчетаПрав <> Неопределено Тогда
						ПротоколРасчетаПрав.Добавить(НСтр("ru = 'Автор резолюции'"));
					КонецЕсли;
					
				Иначе
					
					ВызватьИсключение НСтр("ru = 'Неизвестный ключ пользователя.'");
					
				КонецЕсли;			
				
				ДокументооборотПраваДоступа.ДобавитьПользователяВСоответствиеПрав(
					ПраваДоступа,
					ИсполнительРоли.Исполнитель,
					Неопределено,
					Неопределено,
					ПраваПользователя);
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

// Конец УправлениеДоступом

// Возвращает массив имен ключевых реквизитов
Функция ПолучитьИменаКлючевыхРеквизитов(Версия = Неопределено) Экспорт
	
	МассивИмен = Новый Массив;
	
	Если Версия = 1 Тогда
		МассивИмен.Добавить("Документ");
		МассивИмен.Добавить("АвторРезолюции");
		МассивИмен.Добавить("ВнесРезолюцию");
		МассивИмен.Добавить("ДатаРезолюции");
		МассивИмен.Добавить("ТекстРезолюции");
		МассивИмен.Добавить("Наименование");
	Иначе
		МассивИмен.Добавить("Документ");
		МассивИмен.Добавить("АвторРезолюции");
		МассивИмен.Добавить("ВнесРезолюцию");
		МассивИмен.Добавить("ДатаРезолюции");
		МассивИмен.Добавить("ТекстРезолюции");
	КонецЕсли;
	
	Возврат МассивИмен;
	
КонецФункции
